PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
    const uint8_t *nonce = &req->payload[PROTO_CMD_ARGS_OFFSET];
    const uint8_t *tag_b = &req->payload[PROTO_CMD_ARGS_OFFSET + AUTH_NONCE_LEN];

    uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + AUTH_NONCE_LEN];
    mac_input[0] = g_session_id;
    memcpy(&mac_input[1], g_my_id, PROTO_DEVICE_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_authorized_master_id, PROTO_MASTER_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN], nonce, AUTH_NONCE_LEN);

    uint32_t expect = Slave_Mac32(mac_input, sizeof(mac_input));
    uint32_t got = ((uint32_t)tag_b[0]) |
                   ((uint32_t)tag_b[1] << 8) |
                   ((uint32_t)tag_b[2] << 16) |
                   ((uint32_t)tag_b[3] << 24);
    if (expect != got) {
        return false;
    }

    memcpy(g_session_nonce, nonce, AUTH_NONCE_LEN);
    return true;
}

static uint8_t Slave_BuildPollDataBody(uint8_t *out, uint8_t out_size)
{
    uint8_t body_len = (uint8_t)sizeof(g_sensor_data);
    uint8_t total = (uint8_t)(AUTH_ARG_LEN + body_len);
    if ((out == NULL) || (out_size < total)) {
        return 0U;
    }

    memcpy(out, g_session_nonce, AUTH_NONCE_LEN);

    uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + AUTH_NONCE_LEN];
    mac_input[0] = g_session_id;
    memcpy(&mac_input[1], g_my_id, PROTO_DEVICE_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_authorized_master_id, PROTO_MASTER_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN], g_session_nonce, AUTH_NONCE_LEN);
    uint32_t tag = Slave_Mac32(mac_input, sizeof(mac_input));
    out[4] = (uint8_t)(tag & 0xFFU);
    out[5] = (uint8_t)((tag >> 8) & 0xFFU);
    out[6] = (uint8_t)((tag >> 16) & 0xFFU);
    out[7] = (uint8_t)((tag >> 24) & 0xFFU);

    memcpy(&out[AUTH_ARG_LEN], g_sensor_data, body_len);
    return total;
}

/* ========================================================================== */
/* Deep sleep entry (main idle state)                                          */
/* ========================================================================== */

static void Slave_EnterDeepSleep(void)
{
    g_slave_pwr_trace.stop2_entries++;
    g_slave_pwr_trace.last_stop2_enter_ms = HAL_GetTick();

    /* Ensure CC1101 is in sleep mode */
    CC1101_EnterSleep(&g_cc1101);

    /* If CC2500 was put into SPWD during MICS session, wake it first
     * so WOR strobes/register accesses are valid. */
    (void)CC2500_WakeFromSleep(&g_cc2500);

    /* Put CC2500 into WOR mode for wake-up monitoring */
    CC2500_EnterWOR(&g_cc2500);

    /* Configure RTC for periodic self-check */
    LP_ConfigureRTCWakeUp(&g_lp, SLAVE_RTC_WAKEUP_INTERVAL_S);

    /* Enter Stop 2 - MCU draws ~2 uA
     * Wake-up sources:
     *   - CC2500 GDO0 EXTI (beacon received)
     *   - RTC wake-up timer (periodic self-check)
     */
    LP_WakeupSource src = LP_EnterStop2(&g_lp);

    /* --- MCU wakes up here --- */
    g_slave_pwr_trace.last_stop2_exit_ms = HAL_GetTick();

    if (src & LP_WAKEUP_EXTI_GDO0) {
        g_wakeup_flag = true;
        g_slave_pwr_trace.wakeup_exti_count++;
    }

    if (src & LP_WAKEUP_RTC_ALARM) {
        g_slave_pwr_trace.wakeup_rtc_count++;
        /* Periodic self-check: battery level, sensor status, etc.
         * If nothing to do, go back to sleep immediately */
        g_sensor_data[8] = (uint8_t)(HAL_GetTick() & 0xFFU);  /* timestamp */
    }
}

/* ========================================================================== */
/* Phase 1: Handle CC2500 wake-up beacon                                       */
/* ========================================================================== */

static int Slave_HandleWakeUp(void)
{
    uint8_t rx_buf[CC2500_PKT_MAX_LEN];
    uint8_t rx_len = 0U;

    /* 1) Read the received beacon packet from CC2500 */
    CC2500_Status st = CC2500_ReadPacket(&g_cc2500, rx_buf, &rx_len, sizeof(rx_buf));
    if (st != CC2500_OK) {
        return -1;
    }

    /* 2) Parse MAC PDU */
    Proto_Packet beacon;
    if (Proto_ParsePacket(rx_buf, rx_len, &beacon) < 0) {
        return -2;
    }

    /* 3) Validate FCF: must be COMMAND type, ACK_REQ set */
    if (Proto_FCF_Type(beacon.fcf) != MICS_FCF_TYPE_COMMAND) {
        return -3;
    }
    if (!Proto_FCF_IsAckReq(beacon.fcf)) {
        return -3;
    }

    /* 4) Validate payload layout (13 B):
     *    [0]     DTYPE_COMMAND  [1]      CMD_WAKEUP_REQ
     *    [2..5]  DEVICE_ID      [6..9]   MASTER_ID
     *    [10]    SESS           [11]     CHANNEL      [12] flags
     */
    if (beacon.payload_len < PROTO_BEACON_PAYLOAD_LEN) {
        return -4;
    }
    if (beacon.payload[PROTO_BEACON_DTYPE_OFFSET] != MICS_DTYPE_COMMAND) {
        return -5;
    }
    if (beacon.payload[PROTO_BEACON_CMD_OFFSET] != CMD_WAKEUP_REQ) {
        return -6;
    }

    /* 5) Verify this beacon is addressed to us (or broadcast) */
    const uint8_t *target_id = &beacon.payload[PROTO_BEACON_DEVID_OFFSET];
    if (!Proto_MatchDeviceID(target_id, g_my_id)) {
        return -7;
    }

    /* 6) Verify MASTER_ID - reject beacons from unauthorised Masters.
     *    Without this check, anyone learning the Slave's DEVICE_ID could
     *    wake the implant and hold a session. */
    if (!Proto_VerifyPayloadMasterID(&beacon,
                                     PROTO_BEACON_MASTERID_OFFSET,
                                     g_authorized_master_id)) {
        return -8;  /* silent drop - unknown Master */
    }

    /* 7) Remember the SESS assigned by Master */
    uint8_t assigned_sess = beacon.payload[PROTO_BEACON_SESS_OFFSET];
    if ((assigned_sess == PROTO_SESS_UNASSIGNED) ||
        (assigned_sess == PROTO_SESS_BROADCAST)) {
        return -9; /* invalid SESS allocation */
    }

    /* 8) Remember the MICS channel the Master pre-selected via LBT.
     *    This removes the need for the Slave to scan channels 0..9 on 400 MHz,
     *    which saves significant battery on the implant. */
    uint8_t assigned_channel = beacon.payload[PROTO_BEACON_CHANNEL_OFFSET];
    if (assigned_channel >= CC1101_MICS_NUM_CHANNELS) {
        return -10; /* Master must pre-select a valid MICS channel */
    }

