PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
    g_session_id     = assigned_sess;
    g_active_channel = assigned_channel;
    g_last_rx_seq_valid = false;
    memset(g_session_nonce, 0, sizeof(g_session_nonce));

    /* 9) Build and send wake-up ACK: echo DEVICE_ID + MASTER_ID +
     *    SESS + CHANNEL so Master can verify bilateral binding. */
    Proto_Packet ack;
    ack.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, false, false);
    ack.seq  = g_seq++;
    ack.sess = PROTO_SESS_BROADCAST;  /* session not yet bilaterally confirmed */
    ack.payload_len = Proto_BuildBeaconPayload(CMD_WAKEUP_ACK,
                                               g_my_id,
                                               g_authorized_master_id,
                                               g_session_id,
                                               g_active_channel,
                                               0U,
                                               ack.payload,
                                               sizeof(ack.payload));
    if (ack.payload_len == 0U) {
        return -11;
    }

    uint8_t tx_buf[CC2500_PKT_MAX_LEN];
    uint8_t tx_len = Proto_BuildPacket(&ack, tx_buf, sizeof(tx_buf));
    if (tx_len == 0U) {
        return -12;
    }

    st = CC2500_SendPacketDirect(&g_cc2500, CC2500_WAKEUP_CHANNEL,
                                 tx_buf, tx_len, 100U);
    if (st != CC2500_OK) {
        return -13;
    }

    return 0;
}

/* ========================================================================== */
/* Phase 2: MICS data session                                                  */
/* ========================================================================== */

/* Build a COMMAND-frame response carrying
 *   [DTYPE, sub_cmd, g_my_id, g_authorized_master_id, args...] */
static void slave_build_cmd_response(Proto_Packet *resp,
                                     uint8_t sub_cmd,
                                     const uint8_t *args, uint8_t args_len)
{
    resp->fcf = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, false, false);
    resp->payload_len = Proto_BuildCommandPayload(sub_cmd, g_my_id,
                                                  g_authorized_master_id,
                                                  args, args_len,
                                                  resp->payload,
                                                  sizeof(resp->payload));
}

static int Slave_ProcessCommand(const Proto_Packet *req, Proto_Packet *resp)
{
    /* Session is already validated by caller; just echo SESS */
    resp->seq  = req->seq;
    resp->sess = g_session_id;

    /* All inbound COMMAND packets: payload = [DTYPE, SUBCMD, DEVID[4], args] */
    if (req->payload_len < PROTO_CMD_HEADER_LEN) {
        uint8_t st = PROTO_STATUS_ERR_UNKNOWN_CMD;
        slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
        return 0;
    }

    uint8_t sub_cmd = req->payload[PROTO_CMD_SUBCMD_OFFSET];

    switch (sub_cmd) {
    case CMD_POLL_REQ:
    {
        if (!Slave_VerifyPollAuth(req)) {
            uint8_t st = PROTO_STATUS_ERR_ID_MISMATCH;
            slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
            break;
        }

        uint8_t auth_body[AUTH_ARG_LEN + sizeof(g_sensor_data)];
        uint8_t auth_body_len = Slave_BuildPollDataBody(auth_body, sizeof(auth_body));
        if (auth_body_len == 0U) {
            uint8_t st = PROTO_STATUS_ERR_BUSY;
            slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
            break;
        }

        /* Respond with DATA-type frame:
         *   [DTYPE_ECG_DELTA, g_my_id, g_authorized_master_id, sensor...]
         * DEVICE_ID proves "I am the implant you woke up";
         * MASTER_ID echo proves "I am still bound to this authorised Master". */
        resp->fcf = Proto_FCF_Make(MICS_FCF_TYPE_DATA, false, false);
        resp->payload_len = Proto_BuildDataPayload(MICS_DTYPE_ECG_DELTA,
                                                   g_my_id,
                                                   g_authorized_master_id,
                                                   auth_body,
                                                   auth_body_len,
                                                   resp->payload,
                                                   sizeof(resp->payload));
        break;
    }

    case CMD_DATA_WRITE:
    {
        /* Write args start at payload[PROTO_CMD_ARGS_OFFSET] */
        uint8_t status = (req->payload_len > PROTO_CMD_ARGS_OFFSET)
                         ? PROTO_STATUS_OK
                         : PROTO_STATUS_ERR_UNKNOWN_CMD;
        slave_build_cmd_response(resp, CMD_DATA_ACK, &status, 1U);
        break;
    }

    case CMD_SLEEP_CMD:
        slave_build_cmd_response(resp, CMD_SLEEP_ACK, NULL, 0U);
        break;

    case CMD_KEEPALIVE:
        slave_build_cmd_response(resp, CMD_KEEPALIVE_ACK, NULL, 0U);
        break;

    default:
    {
        uint8_t st = PROTO_STATUS_ERR_UNKNOWN_CMD;
        slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
        break;
    }
    }

    return 0;
}

static void Slave_SendResponse(const Proto_Packet *resp, uint8_t channel)
{
    uint8_t tx_buf[CC1101_PKT_MAX_LEN];
    uint8_t tx_len = Proto_BuildPacket(resp, tx_buf, sizeof(tx_buf));
    if (tx_len == 0U) {
        return;
    }

    /* Slave responds on the channel Master selected (Master already cleared
     * it via LBT). Use SendPacketLBT with threshold=-120 dBm so the CCA
     * always passes (effectively direct send). */
    (void)CC1101_SendPacketLBT(&g_cc1101, channel,
                               tx_buf, tx_len,
                               -120, 1U, 200U);
}

static int Slave_HandleMICSSession(void)
{
    uint8_t rx_buf[CC1101_PKT_MAX_LEN];
    uint8_t rx_len = 0U;
    Proto_Packet req_pkt, resp_pkt;
    bool session_active = true;
    uint32_t session_start = HAL_GetTick();
    g_slave_pwr_trace.mics_session_count++;
    g_slave_pwr_trace.last_session_start_ms = session_start;

    /* Guard: a valid channel must have been assigned in the wake-up beacon */
    if (g_active_channel >= CC1101_MICS_NUM_CHANNELS) {
        return -1;
    }

    /* Initialize CC1101 for MICS communication */
    CC1101_WakeFromSleep(&g_cc1101);
    CC1101_InitMICSLike26MHz(&g_cc1101);

