PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
    /* CC2500 is not needed during active 400 MHz session.
     * Put it into deep sleep to cut parallel radio current. */
    (void)CC2500_EnterSleep(&g_cc2500);

    while (session_active) {
        /* Check session timeout */
        if ((HAL_GetTick() - session_start) > PROTO_SESSION_TIMEOUT_MS) {
            g_slave_pwr_trace.mics_timeout_count++;
            break;
        }

        /* Tune to the channel the Master pre-selected via LBT - no scanning */
        CC1101_Status st = CC1101_WaitAndReadPacket(&g_cc1101,
                                                    g_active_channel,
                                                    rx_buf, &rx_len,
                                                    sizeof(rx_buf),
                                                    SLAVE_MICS_RX_WINDOW_MS);
        if (st != CC1101_OK) {
            continue;
        }

        if (Proto_ParsePacket(rx_buf, rx_len, &req_pkt) < 0) {
            continue;
        }

        /* Filter by session ID (1B fast check) */
        if (!Proto_MatchSession(req_pkt.sess, g_session_id)) {
            continue;
        }
        if (g_last_rx_seq_valid && !Proto_IsSeqNewer(req_pkt.seq, g_last_rx_seq)) {
            continue; /* replay/duplicate/out-of-order */
        }
        g_last_rx_seq = req_pkt.seq;
        g_last_rx_seq_valid = true;

        /* Only COMMAND frames are accepted from Master on 400 MHz */
        if (Proto_FCF_Type(req_pkt.fcf) != MICS_FCF_TYPE_COMMAND) {
            continue;
        }
        if ((req_pkt.payload_len < PROTO_CMD_HEADER_LEN) ||
            (req_pkt.payload[PROTO_CMD_DTYPE_OFFSET] != MICS_DTYPE_COMMAND)) {
            continue;
        }

        /* Triple-verify the handoff from 2.4 GHz wake-up:
         *   - SESS (already matched above)
         *   - DEVICE_ID in payload offset 2..5
         *   - MASTER_ID in payload offset 6..9
         * DEVICE_ID proves the Master still knows whom it woke up.
         * MASTER_ID proves this is the same authorised Master that
         * initiated the wake-up (and not a concurrent Master guessing
         * the SESS). Silently drop unauthenticated COMMAND frames so
         * the attacker gains no side-channel signal. */
        if (!Proto_VerifyPayloadDeviceID(&req_pkt,
                                         PROTO_CMD_DEVID_OFFSET,
                                         g_my_id)) {
            continue;
        }
        if (!Proto_VerifyPayloadMasterID(&req_pkt,
                                         PROTO_CMD_MASTERID_OFFSET,
                                         g_authorized_master_id)) {
            continue;
        }

        /* Process command and send response on the same channel */
        Slave_ProcessCommand(&req_pkt, &resp_pkt);
        Slave_SendResponse(&resp_pkt, g_active_channel);

        /* Check if session should end (SLEEP command) */
        if ((req_pkt.payload_len >= PROTO_CMD_HEADER_LEN) &&
            (req_pkt.payload[PROTO_CMD_SUBCMD_OFFSET] == CMD_SLEEP_CMD)) {
            session_active = false;
        }

        /* Reset session timer on valid packet */
        session_start = HAL_GetTick();
    }

    /* Invalidate session */
    g_session_id     = PROTO_SESS_UNASSIGNED;
    g_active_channel = PROTO_CHANNEL_UNASSIGNED;
    g_last_rx_seq_valid = false;
    memset(g_session_nonce, 0, sizeof(g_session_nonce));
    g_slave_pwr_trace.last_session_end_ms = HAL_GetTick();
    return 0;
}

/* ========================================================================== */
/* main                                                                        */
/* ========================================================================== */

int main(void)
{
    HAL_Init();

    /* SystemClock_Config() - generated by CubeMX */
    /* MX_GPIO_Init(), MX_SPI1_Init(), MX_SPI2_Init(), MX_RTC_Init() */

    Slave_InitHardware();

    /* Put CC1101 to sleep at startup (not needed until communication) */
    CC1101_EnterSleep(&g_cc1101);

    while (1) {
        /* Enter deep sleep - this is the primary state
         * MCU + CC1101 in deep sleep
         * CC2500 in WOR mode, sniffing for wake-up beacons
         */
        Slave_EnterDeepSleep();

        /* Check if woken by CC2500 beacon */
        if (g_wakeup_flag) {
            g_wakeup_flag = false;

            /* Handle the wake-up beacon - parses and stores SESS */
            int rc = Slave_HandleWakeUp();

            if (rc == 0) {
                g_slave_pwr_trace.wakeup_ok_count++;
                /* Wake-up successful - enter MICS data session */
                Slave_HandleMICSSession();
            } else {
                g_slave_pwr_trace.wakeup_fail_count++;
            }

            /* Session done or wake-up failed - return to deep sleep */
            CC1101_EnterSleep(&g_cc1101);
        }

        /* If woken by RTC, the self-check was done in Slave_EnterDeepSleep.
         * Loop back to sleep. */
    }
}
